eisup_2019_docmng_integration/src/BusinessProcesses/абсПереутверждениеКонтрагентов/абсПереутверждениеКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсПереутверждениеКонтрагентов</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСтарта</name>
    <type>
      <types>BusinessProcessRoutePointRef.абсПереутверждениеКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаИзменениеРеквизитов</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абсСтатусыКонтрагентов/абсСтатусыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыКонтрагентов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>ЗавершениеОтношений</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереутверждение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СменаРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеИспользуется</name>
      <description>_Не используется</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодрядаНеИСП</name>
      <description>(Не исп.) Согласование договоров подряда</description>
    </items>
    <items>
      <name>Бухгалтерия</name>
      <description>Бухгалтерия</description>
    </items>
    <items>
      <name>ДФМ</name>
      <description>ДФМ</description>
    </items>
    <items>
      <name>НастройкаПрав</name>
      <description>Настройка прав</description>
    </items>
    <items>
      <name>НачислениеРНПД</name>
      <description>Начисление РНПД</description>
    </items>
    <items>
      <name>ОбщиеРоли</name>
      <description>Общие роли</description>
    </items>
    <items>
      <name>Поддержка</name>
      <description>Поддержка</description>
    </items>
    <items>
      <name>ПроектныйУчет</name>
      <description>Проектный учет</description>
    </items>
    <items>
      <name>РаботаСДоговорами</name>
      <description>Работа с договорами</description>
    </items>
    <items>
      <name>РолиИСУЗК</name>
      <description>Роли ИСУЗК</description>
    </items>
    <items>
      <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
      <description>Согласование актов приёмки выполненных работ</description>
    </items>
    <items>
      <name>СогласованиеБюджета</name>
      <description>Согласование бюджета</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодряда</name>
      <description>Согласование договоров подряда</description>
    </items>
    <items>
      <name>ЗакупочныеЗаказыСчета</name>
      <description>Согласование закупочных заказов и счетов</description>
    </items>
    <items>
      <name>СогласованиеЗаявокНаОбеспечениеТМЦ</name>
      <description>Согласование заявок на обеспечение ТМЦ</description>
    </items>
    <items>
      <name>СогласованиеОС</name>
      <description>Согласование ОС</description>
    </items>
    <items>
      <name>ttk_Аудитор</name>
      <description>Аудитор</description>
    </items>
    <items>
      <name>БюджетныйКонтролер</name>
      <description>Бюджетный контролер</description>
    </items>
    <items>
      <name>ttk_ВалютныйКонтроль</name>
      <description>Валютный контроль</description>
    </items>
    <items>
      <name>ВводКЗР</name>
      <description>Ввод КЗР</description>
    </items>
    <items>
      <name>ВводОперацияБУНУ</name>
      <description>Ввод операция БУНУ</description>
    </items>
    <items>
      <name>УстановкаСоответствияАналитикВыручки</name>
      <description>Ввод соответствий аналитик выручки</description>
    </items>
    <items>
      <name>ДирККР</name>
      <description>Дир ККР</description>
    </items>
    <items>
      <name>ДирККРвКТТК</name>
      <description>Дир ККР в КТТК</description>
    </items>
    <items>
      <name>ttk_РуководительБП</name>
      <description>Начальник бюджетного планирования</description>
    </items>
    <items>
      <name>ОтказПоАвизо</name>
      <description>Отказ по авизо</description>
    </items>
    <items>
      <name>ОткрытиеДокументаИнтеграцияСHyperion</name>
      <description>Открытие и работа с документом Интеграция с hyperion</description>
    </items>
    <items>
      <name>ОформлениеАВЗ</name>
      <description>Оформление АВЗ</description>
    </items>
    <items>
      <name>Переутверждение</name>
      <description>Переутверждение</description>
    </items>
    <items>
      <name>ПроведениеППДБезКонтроляМаппинга</name>
      <description>Проведение ППД без контроля маппинга</description>
    </items>
    <items>
      <name>РедактированиеДатыРасходаЗРС</name>
      <description>Редактирование даты расхода ЗРС</description>
    </items>
    <items>
      <name>РедактированиеППДБезКонтроляДатыЗапрета</name>
      <description>Редактирование ППД без контроля даты запрета</description>
    </items>
    <items>
      <name>ttk_РуководительДБО</name>
      <description>Руководитель департамента бюджетирования и отчетности</description>
    </items>
    <items>
      <name>РуководительДК</name>
      <description>Руководитель ДК</description>
    </items>
    <items>
      <name>РуководительПД</name>
      <description>Руководитель ПД</description>
    </items>
    <items>
      <name>СогласованиеДИБ</name>
      <description>Согласование ДИБ</description>
    </items>
    <items>
      <name>СогласованиеДРСД</name>
      <description>Согласование ДРСД</description>
    </items>
    <items>
      <name>СогласованиеДРУ</name>
      <description>Согласование ДРУ</description>
    </items>
    <items>
      <name>СогласованиеДУП</name>
      <description>Согласование ДУП</description>
    </items>
    <items>
      <name>СогласованиеДЭБ</name>
      <description>Согласование ДЭБ</description>
    </items>
    <items>
      <name>ttk_СогласованиеЗакупкиМКР</name>
      <description>Согласование Закупки МКР</description>
    </items>
    <items>
      <name>СогласованиеКонтрагентовЮристами</name>
      <description>Согласование контрагентов юристами</description>
    </items>
    <items>
      <name>СогласованиеКТТК</name>
      <description>Согласование КТТК (филиалы)</description>
    </items>
    <items>
      <name>СогласованиеПД</name>
      <description>Согласование ПД</description>
    </items>
    <items>
      <name>СогласованиеПЛ</name>
      <description>Согласование Первым лицом</description>
    </items>
    <items>
      <name>СогласованиеРекласификацииБюджетаДЭИ</name>
      <description>Согласование рекласификации бюджета (ДЭИ)</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДКП</name>
      <description>Согласование руководителя ДКП</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДОП</name>
      <description>Согласование руководителя ДОП</description>
    </items>
    <items>
      <name>СогласованиеСОКДЭБ</name>
      <description>Согласование СОК (ДЭБ)</description>
    </items>
    <items>
      <name>СогласованиеДВКУР</name>
      <description>Согласование ЦОЗД КТТК</description>
    </items>
    <items>
      <name>ttk_СогласованиеЦФК</name>
      <description>Согласование ЦФК</description>
    </items>
    <items>
      <name>СотрудникГруппыНСИ</name>
      <description>Сотрудник группы НСИ</description>
    </items>
    <items>
      <name>СотрудникДК</name>
      <description>Сотрудник ДК</description>
    </items>
    <items>
      <name>СотрудникСклада</name>
      <description>Сотрудник склада</description>
    </items>
    <items>
      <name>СуперПользователь</name>
      <description>Супер пользователь</description>
    </items>
    <items>
      <name>СуперПользовательДЗО</name>
      <description>Супер пользователь ДЗО</description>
    </items>
    <items>
      <name>ТипКонтрагентаМСФО</name>
      <description>Тип контрагента (МСФО)</description>
    </items>
    <items>
      <name>абс_ТрансфертноеЦенообразование</name>
      <description>Трансфертное ценообразование</description>
    </items>
    <items>
      <name>УстановкаПроектаСтатьи</name>
      <description>Установка проекта статьи</description>
    </items>
  </predefined>
  <attributes>
    <name>абс_РольИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/BusinessProcesses/абсПереутверждениеКонтрагентов/ObjectModule.bsl
// Процедуры создания групповых задач
Процедура ПереутверждениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абсПереутверждениеКонтрагентов.ТочкиМаршрута.Переутверждение Тогда
		Для Каждого Задача Из ФормируемыеЗадачи Цикл
			Задача.Исполнитель = Задача.БизнесПроцесс.ПользовательИнициаторБП;
			
			Задача.ОбъектЗадачи = Контрагент;
			Если ЗначениеЗаполнено(Задача.БизнесПроцесс.Контрагент) Тогда
				//Задача.Наименование = Строка(Задача.БизнесПроцесс.Контрагент) + ". " + Задача.Наименование;
				
				Задача.Наименование = СокрЛП(Контрагент.Наименование) + " "  
					+ Задача.Наименование + ".";
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
//	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
КонецПроцедуры

Процедура ПроверкаСотрудникомДФМПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура ПроверкаСотрудникомПДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
КонецПроцедуры

Процедура ДействиеСогласованиеКонтрагентаСотрудникомДЭБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи)
	ФормируемыеЗадачи.Очистить();
	
	ЗапросИсполнителей = Новый Запрос("ВЫБРАТЬ
	                                  |	РолиИИсполнители.Исполнитель
	                                  |ИЗ
	                                  |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	                                  |ГДЕ
	                                  |	РолиИИсполнители.Роль = &РольИсполнителей");
									  
	РольИсполнителей = Неопределено;									  
	Если ТочкаМаршрута = БизнесПроцессы.абсПереутверждениеКонтрагентов.ТочкиМаршрута.Переутверждение Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.Переутверждение;
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.абсПереутверждениеКонтрагентов.ТочкиМаршрута.ДействиеПроверкаДФМ Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.ПроверкаДФМ;
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.абсПереутверждениеКонтрагентов.ТочкиМаршрута.ДействиеСогласованиеДЭБ Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.СогласованиеДЭБ;
	КонецЕсли;
	
	Если РольИсполнителей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросИсполнителей.УстановитьПараметр("РольИсполнителей", РольИсполнителей);
	
	ВыборкаИсполнителей = ЗапросИсполнителей.Выполнить().Выбрать();
	
	//абс изменение Урал 28.01.2014: Формирование одной задачи
	Если ВыборкаИсполнителей.Количество() Тогда
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрута;
		НоваяЗадача.Дата 				= ТекущаяДата();
		//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
		
		НоваяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + " "  
			+ ТочкаМаршрута.НаименованиеЗадачи + ".";
		
		
		НоваяЗадача.Роль			    = РольИсполнителей;
		
		НоваяЗадача.ОбъектЗадачи		= Контрагент;
		
		НоваяЗадача.Записать();
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	КонецЕсли;
	//\\абс Урал
	
КонецПроцедуры

// Процедуры проверки условий и вариантов выполнения БП
Процедура УсловиеСогласованиеПДПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Контрагент.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеДЭБ;
КонецПроцедуры

Процедура ВыборВариантаСогласованиеПДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ТекСтатусКонтрагента = Контрагент.абс_СтатусКонтрагента; 
	
	Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверкаДФМ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	КонецЕсли;

КонецПроцедуры

Процедура ВыборВариантаСогласованиеДЭБОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
		
	ТекСтатусКонтрагента = Контрагент.абс_СтатусКонтрагента; 
	
	Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверкаДФМ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Активный Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантАктивный;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	КонецЕсли;

КонецПроцедуры

// Процедуры обработчики интеррактивной активизации
Процедура ПереутверждениеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	
	ФормаКонтрагента = Контрагент.ПолучитьФорму("ФормаЭлемента",, Контрагент);
	//ФормаКонтрагента.КлючУникальности = Задача;
	
	Если ФормаКонтрагента.Открыта() Тогда
		ФормаКонтрагента.Активизировать();
	Иначе
		ФормаКонтрагента.Открыть();
	КонецЕсли;

КонецПроцедуры

Процедура ДействиеСогласованиеДЭБОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	
	ФормаКонтрагента = Контрагент.ПолучитьФорму("ФормаЭлемента",,Контрагент);
	//ФормаКонтрагента.КлючУникальности = Задача;
	
	Если ФормаКонтрагента.Открыта() Тогда
		ФормаКонтрагента.Активизировать();
	Иначе
		ФормаКонтрагента.Открыть();
	КонецЕсли;

КонецПроцедуры

Процедура ДействиеСогласованиеПДОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	
	ФормаКонтрагента = Контрагент.ПолучитьФорму("ФормаЭлемента",,Контрагент);
	//ФормаКонтрагента.КлючУникальности = Задача;
	
	Если ФормаКонтрагента.Открыта() Тогда
		ФормаКонтрагента.Активизировать();
	Иначе
		ФормаКонтрагента.Открыть();
	КонецЕсли;

КонецПроцедуры

Процедура ДействиеПроверкаДФМОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	
	ФормаКонтрагента = Контрагент.ПолучитьФорму("ФормаЭлемента",,Контрагент);
	//ФормаКонтрагента.КлючУникальности = Задача;
	
	Если ФормаКонтрагента.Открыта() Тогда
		ФормаКонтрагента.Активизировать();
	Иначе
		ФормаКонтрагента.Открыть();
	КонецЕсли;

КонецПроцедуры

// Процедуры обработчики ПриВыполненииЗадач
Процедура ПереутверждениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура ДействиеПроверкаДФМПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура ДействиеСогласованиеПДПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура ДействиеСогласованиеДЭБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса)
	// Выполним остальные задачи на данной точке 
	ЗапросЗадач = Новый Запрос("ВЫБРАТЬ
	                           |	абсЗадачаДоговора.Ссылка
	                           |ИЗ
	                           |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	                           |ГДЕ
	                           |	абсЗадачаДоговора.БизнесПроцесс = &БизнесПроцесс
	                           |	И абсЗадачаДоговора.ТочкаМаршрута = &ТочкаМаршрута
	                           |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ");
	ЗапросЗадач.УстановитьПараметр("БизнесПроцесс", Ссылка);
	ЗапросЗадач.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрутаБизнесПроцесса);
	
	ВыборкаЗадач = ЗапросЗадач.Выполнить().Выбрать();
	
	Пока ВыборкаЗадач.Следующий() Цикл
		ЗадачаОбъект = ВыборкаЗадач.Ссылка.ПолучитьОбъект();
		
		ЗадачаОбъект.Выполнить();
	КонецЦикла;
КонецПроцедуры

// Процедуры обработчики ПередСтартом
Процедура СтартСменаРеквизитовПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ТочкаСтарта = ТочкаМаршрутаБизнесПроцесса;
	
КонецПроцедуры

Процедура СтартПереутверждениеПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ТочкаСтарта = ТочкаМаршрутаБизнесПроцесса;

КонецПроцедуры

// Процедуры обработчики ПриЗавершении
Процедура ЗавершениеОтказПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(Контрагент.абс_СтатусКонтрагента);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура ЗавершениеУтвержденПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(Контрагент.абс_СтатусКонтрагента);
	
абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);	
	
КонецПроцедуры


Процедура ЗавершитьБП(СтатусЗавершения)
	
	// Закроем задачи проверки контрагента по договорам
	СтатусДоговора = Неопределено;
	
	Если СтатусЗавершения = Перечисления.абсСтатусыКонтрагентов.Активный Тогда
		СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ;
	ИначеЕсли ТочкаСтарта = БизнесПроцессы.абсПереутверждениеКонтрагентов.ТочкиМаршрута.СтартСменаРеквизитов Тогда
		СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ;
	Иначе
		СтатусДоговора = Перечисления.абсСтатусыДоговоров.Отказ;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	абсЗадачаДоговора.Ссылка,
	                      |	абсЗадачаДоговора.ОбъектЗадачи КАК ДоговорКонтрагента
	                      |ИЗ
	                      |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	                      |ГДЕ
	                      |	абсЗадачаДоговора.ОбъектЗадачи ССЫЛКА Справочник.ДоговорыКонтрагентов
	                      |	И абсЗадачаДоговора.ОбъектЗадачи.Владелец = &Контрагент
	                      |	И абсЗадачаДоговора.ТочкаМаршрута = &ТочкаМаршрута
	                      |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ
	                      |	И абсЗадачаДоговора.ОбъектЗадачи.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.ПроверкаКонтрагента)");
						  
						  
	Запрос.УстановитьПараметр("Контрагент"		, Контрагент);
	Запрос.УстановитьПараметр("ТочкаМаршрута"	, БизнесПроцессы.абсСогласованиеДоговоров.ТочкиМаршрута.ДействиеПроверкаКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Сначала изменим статус в карточке договора
		// потом в регистре
		// потом выполним задачу
		ДоговорОбъект = Выборка.ДоговорКонтрагента.ПолучитьОбъект();
		
		ДоговорОбъект.абс_СтатусДоговора = СтатусДоговора;
		
		ДоговорОбъект.абс_ПричинаИзмененияСтатуса = "Контрагент перешел в статус " + СокрЛП(Контрагент.абс_СтатусКонтрагента);
		
		ДоговорОбъект.Записать();
		
		//ДоговорОбъект.ЗаписатьНовыйСтатус(ДоговорОбъект.абс_СтатусДоговора, "Контрагент перешел в статус " + СокрЛП(ДоговорОбъект.абс_СтатусДоговора));
		
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ЗадачаОбъект.ВыполнитьЗадачу();	
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ВыборВариантаПроверкаДФМОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ТекСтатусКонтрагента = Контрагент.абс_СтатусКонтрагента; 
	
	Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Активный Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантКонтрагентИзБиллинга;
	КонецЕсли;	
		
КонецПроцедуры
